InduPriya1525/ATTTENDANCE-MANAGEMENT-SYSTEM-USING-STM32F401/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2023 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include"as608.h"
#include<stdbool.h>
#include"string.h"
#include"stdio.h"
#include "retarget.h"
#include<stdlib.h>
#include "lcd1602.h"
#include "stm32f4xx_hal.h"
#include "stm32f4xx_it.h"
#include <stdio.h>
#include "delay.h"
#include "uart.h"
#include "eeprom.h"
#include "stm32f4xx.h"
#include <stdint.h>

#define RXBUFFER_SIZE	50
#define MAX_PEOPLE 256
#define MAX_NAME_LENGTH 256
#define MAX_NUM_TEMPLATES 254
#define timer htim3
#define MAX_RETRIES 3 // Maximum number of retries
#define FLASH_SECTOR_TO_ERASE FLASH_SECTOR_4
#define TIME_DELAY_BETWEEN_ARRIVALS_MS 60000
#define EEP_ADDR 0x08010000
#define EEP_SIZE 0x0400

extern TIM_HandleTypeDef timer;
void delay (uint16_t us)
{
	__HAL_TIM_SET_COUNTER(&timer, 0);
	while (__HAL_TIM_GET_COUNTER(&timer) < us);
}

extern uint8_t Tone_Status;
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
//int stored_fingerprint[5][100];
//int fingerprint_data;
uint16_t id=0 ;
uint32_t KeyPressed = 1;
uint8_t eepadd=0;

bool removeFingerPlaceFinger = false;
bool fingerprintStored = false;
uint8_t fingerprintStatus = FINGERPRINT_NOFINGER;
bool fingerprintOk = false;
bool fingerprintDeleted = false;
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */
uint32_t temp=0;
typedef struct
{
	uint8_t emp_id;
} Emp_info;

Emp_info employee[10000];
char enrollment_names[][20]={{},{"VISHVESH"},{"Indu"},{"BINDHU"},{"SHUSHMA"},{"DHANA"},{" NARESH"},{"RAVI"},{"RAJESH"},{"SNEHA"},{"LINA"},{"VINAY"},{"NAVEEN"},{"PRADY"},{"NARESH.S"},{"JYOTHI"}};
char ids[3]; 					// Create an array to store 3 characters

EEPROMTypedefStatus eeprom_write(uint16_t add, uint32_t pData);
EEPROMTypedefStatus eeprom_read(uint16_t add, uint32_t *pData);
void set_time(void);
void get_time(void);
void display_time(void);
/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
RTC_HandleTypeDef hrtc;
RTC_TimeTypeDef sTime;
RTC_DateTypeDef sDate;
RTC_TimeTypeDef gTime;
RTC_TimeTypeDef arrivalTime;
RTC_DateTypeDef arrivalDate;

TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */
GPIO_InitTypeDef GPIO_InitStructPrivate = {0};
uint32_t previousMillis = 0;
uint32_t currentMillis = 0;
uint8_t keyPressed = 0;

char C_time[12];
char date[20];
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_RTC_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM3_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART2_UART_Init(void);
void eraseFlashSector(uint32_t sector);

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
int row=0;
int col=0;
typedef struct
{
	uint16_t start_code;                    //< "Wakeup" code for packet detection
	uint8_t address[4];                    //< 32-bit Fingerprint sensor address
	uint8_t type;                         //< Type of packet
	uint16_t length;                     //< Length of packet
	uint8_t data[64];                   //< The raw buffer for packet payload
}as608Packet_t;

static as608Packet_t packet;
static uint8_t rxPacketBuffer[RXBUFFER_SIZE];
uint8_t FindFingerprint(void);
void EnrollFinger(uint8_t id);
uint8_t AS608_TEMPLATECOUNT(void);
uint8_t AS608_StoreModel(uint16_t id);
void InputFinger(void);
void DeleteFinger(void);
uint8_t MatchFinger(void);
void playTone(uint16_t frequency,uint16_t ms,uint8_t dc);
void stopTone(void);

uint16_t matchingPageID;
uint16_t f_status;
uint8_t Rxbuff = 0;
uint8_t RxbuffCntr = 0;
uint8_t txCplt = SET;
uint8_t RxCplt = 0;
uint8_t keypressed =  0;


extern uint16_t i;
extern uint16_t e_size;
void set_time(void)
{
	/** Initialize RTC and set the Time and Date
	 */
	sTime.Hours = 0x2;
	sTime.Minutes = 0x3;
	sTime.Seconds = 0x4;
	sTime.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
	sTime.StoreOperation = RTC_STOREOPERATION_RESET;
	if (HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BCD) != HAL_OK)
	{
		Error_Handler();
	}
	sDate.WeekDay = RTC_WEEKDAY_FRIDAY;
	sDate.Month = RTC_MONTH_MAY;
	sDate.Date = 0x6;
	sDate.Year = 0x23;

	if (HAL_RTC_SetDate(&hrtc, &sDate, RTC_FORMAT_BCD) != HAL_OK)
	{
		Error_Handler();
	}
	HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR1, 0x32F2);
}

void get_time(void)
{
	RTC_DateTypeDef gDate;
	HAL_RTC_GetTime(&hrtc, &gTime, RTC_FORMAT_BIN);
	HAL_RTC_GetDate(&hrtc, &gDate, RTC_FORMAT_BIN);
	sprintf((char *)C_time, "%02d:%02d:%02d\n", gTime.Hours, gTime.Minutes, gTime.Seconds);
	sprintf((char *)date, "%02d-%02d-%2d\n", gDate.Date, gDate.Month, 2000 + gDate.Year);

	// Copy the current time to the arrivalTime variable

	arrivalTime.Hours = gTime.Hours;
	arrivalTime.Minutes = gTime.Minutes;
	arrivalTime.Seconds= gTime.Seconds;
	arrivalDate.Date=gDate.Date;
	arrivalDate.Month=gDate.Month;
	arrivalDate.Year=gDate.Year;
}


void display_time (void)
{
	HAL_UART_Transmit(&huart2, (uint8_t*)(C_time) ,12 , 100);
	HAL_UART_Transmit(&huart2, (uint8_t*)date , 20 , 100);
}
/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void)
{
	/* USER CODE BEGIN 1 */

	/* USER CODE END 1 */

	/* MCU Configuration--------------------------------------------------------*/

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */

	HAL_Init();

