InduPriya1525/ATTTENDANCE-MANAGEMENT-SYSTEM-USING-STM32F401/Core/Src/main.c
	/* USER CODE BEGIN Init */

	/* USER CODE END Init */

	/* Configure the system clock */
	SystemClock_Config();

	/* USER CODE BEGIN SysInit */

	/* USER CODE END SysInit */

	/* Initialize all configured peripherals */
	MX_GPIO_Init();
	MX_RTC_Init();
	MX_TIM2_Init();
	MX_TIM3_Init();
	MX_USART1_UART_Init();
	MX_USART2_UART_Init();
	/* USER CODE BEGIN 2 */
	HAL_TIM_Base_Start(&htim3);
	lcd_init ();
	lcd_clear();
	RetargetInit(&huart2);
	HAL_UART_Receive_IT(&huart1, (uint8_t *)&Rxbuff, sizeof(Rxbuff));
	HAL_UART_Receive_IT(&huart2, (uint8_t *)&Rxbuff, sizeof(Rxbuff));
	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_15, 1);
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_3, 1);
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_4, 1);
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_5, 1);

	set_time();
	eeprom_init(EEP_ADDR,EEP_SIZE);

	get_time();
	display_time();

	/* USER CODE END 2 */
	//     eraseFlashSector(FLASH_SECTOR_TO_ERASE);  //erases a specified Flash memory sector.
	/* Infinite loop */
	/* USER CODE BEGIN WHILE */
	printf("\nchoose\nA.Enroll\nB.Find\nC.Delete\nD.DeleteAll\n");
	/* USER CODE END WHILE */

	/* USER CODE BEGIN 3 */
	lcd_init ();
	lcd_clear();
	HAL_Delay(1500);
	lcd_put_cur(0,0);
	/* USER CODE END 3 */
	while (1)
	{

		lcd_send_string("AenBfndCdelDdela");										//print the function
		lcd_send_cmd(0x02);															//to place the cursor at starting
		HAL_Delay(1500);
		if(keyPressed == 65 )
		{
			keyPressed = 0;
			MatchFinger();
		}
		else if(keyPressed == 66)
		{
			keyPressed = 0;
			unsigned int employee_ID =	FindFingerprint();

			get_time();                                    // Get the current time and date using the RTC peripheral and store it in arrivalTime and arrivalDate variables.
			eeprom_write(eepadd, employee_ID);
			//eeprom_write(eepadd, employee->emp_id); // Write the employee ID to EEPROM at the address pointed by eepadd.
			eeprom_write(eepadd+1, arrivalTime.Hours);     // Write the hours of arrivalTime to EEPROM at the next address.
			eeprom_write(eepadd+2, arrivalTime.Minutes);   // Write the minutes of arrivalTime to EEPROM at the next address.
			eeprom_write(eepadd+3, arrivalTime.Seconds);   // Write the seconds of arrivalTime to EEPROM at the next address.
			eeprom_write(eepadd+4, arrivalDate.Date);      // Write the date of arrivalDate to EEPROM at the next address.
			eeprom_write(eepadd+5, arrivalDate.Month);     // Write the month of arrivalDate to EEPROM at the next address.
			eeprom_write(eepadd+6, arrivalDate.Year);      // Write the year of arrivalDate to EEPROM at the next address.
			eepadd+=7;                                     // Move the EEPROM address pointer to the next set of memory locations for the next employee.
			KeyPressed=0;                                  // Reset the KeyPressed flag to indicate that the key press has been processed.
		}
		else if(keyPressed == 67 )
		{
			keyPressed = 0;
			DeleteFinger();
		}
		else if (keyPressed == 68){
			keyPressed = 0;
			AS608_EmptyDatabase();
			lcd_send_string("Allfingerdeleted");
			printf("ALL DELETED");
			playTone(800,1000,20);
			stopTone();
		}

	}
}

/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void)
{
	RCC_OscInitTypeDef RCC_OscInitStruct = {0};
	RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

	/** Configure the main internal regulator output voltage
	 */
	__HAL_RCC_PWR_CLK_ENABLE();
	__HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE2);

	/** Initializes the RCC Oscillators according to the specified parameters
	 * in the RCC_OscInitTypeDef structure.
	 */
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI|RCC_OSCILLATORTYPE_LSI;
	RCC_OscInitStruct.HSIState = RCC_HSI_ON;
	RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
	RCC_OscInitStruct.LSIState = RCC_LSI_ON;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
	RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
	RCC_OscInitStruct.PLL.PLLM = 8;
	RCC_OscInitStruct.PLL.PLLN = 84;
	RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
	RCC_OscInitStruct.PLL.PLLQ = 4;
	if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
	{
		Error_Handler();
	}

	/** Initializes the CPU, AHB and APB buses clocks
	 */
	RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
			|RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
	RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
	RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

	if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
	{
		Error_Handler();
	}
}

/**
 * @brief RTC Initialization Function
 * @param None
 * @retval None
 */
static void MX_RTC_Init(void)
{

	/* USER CODE BEGIN RTC_Init 0 */

	/* USER CODE END RTC_Init 0 */

	RTC_TimeTypeDef sTime = {0};
	RTC_DateTypeDef sDate = {0};

	/* USER CODE BEGIN RTC_Init 1 */

	/* USER CODE END RTC_Init 1 */

	/** Initialize RTC Only
	 */
	hrtc.Instance = RTC;
	hrtc.Init.HourFormat = RTC_HOURFORMAT_24;
	hrtc.Init.AsynchPrediv = 127;
	hrtc.Init.SynchPrediv = 255;
	hrtc.Init.OutPut = RTC_OUTPUT_DISABLE;
	hrtc.Init.OutPutPolarity = RTC_OUTPUT_POLARITY_HIGH;
	hrtc.Init.OutPutType = RTC_OUTPUT_TYPE_OPENDRAIN;
	if (HAL_RTC_Init(&hrtc) != HAL_OK)
	{
		Error_Handler();
	}

	/* USER CODE BEGIN Check_RTC_BKUP */

	/* USER CODE END Check_RTC_BKUP */

	/** Initialize RTC and set the Time and Date
	 */
	sTime.Hours = 0x12;
	sTime.Minutes = 0x50;
	sTime.Seconds = 0x45;
	sTime.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
	sTime.StoreOperation = RTC_STOREOPERATION_RESET;
	if (HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BCD) != HAL_OK)
	{
		Error_Handler();
	}
	sDate.WeekDay = RTC_WEEKDAY_TUESDAY;
	sDate.Month = RTC_MONTH_SEPTEMBER;
	sDate.Date = 0x12;
	sDate.Year = 0x23;

	if (HAL_RTC_SetDate(&hrtc, &sDate, RTC_FORMAT_BCD) != HAL_OK)
	{
		Error_Handler();
	}
	/* USER CODE BEGIN RTC_Init 2 */

	/* USER CODE END RTC_Init 2 */

