InduPriya1525/ATTTENDANCE-MANAGEMENT-SYSTEM-USING-STM32F401/Core/Src/main.c
	HAL_NVIC_SetPriority(EXTI3_IRQn, 0, 0);
	HAL_NVIC_EnableIRQ(EXTI3_IRQn);

	HAL_NVIC_SetPriority(EXTI4_IRQn, 0, 0);
	HAL_NVIC_EnableIRQ(EXTI4_IRQn);

	HAL_NVIC_SetPriority(EXTI9_5_IRQn, 0, 0);
	HAL_NVIC_EnableIRQ(EXTI9_5_IRQn);
	/* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */
uint8_t FindFingerprint(void)
{
	HAL_Delay(1000);																						 // Delay for 1 second
	uint8_t f_status = AS608_GetImage(); 																	 // Attempt to capture a fingerprint image
	if (f_status != FINGERPRINT_OK) {
		printf("error in the getimage");																	 // Print an error message to the console
		lcd_send_string("errorinfinger");                                                                    // Send an error message to the LCD
		HAL_Delay(1000);                                                                                     // Delay for 1 second
		lcd_clear();                                                                                         // Clear the LCD display
		return f_status;                                                                                     // Return the status code
	}
	HAL_Delay(1000);                                                                                         // Delay for 1 second
	f_status = AS608_Image2Tz(1);                                                                            // Convert the captured image to a template
	if (f_status != FINGERPRINT_OK) {
		printf("convert fail");                                                                              // Print an error message to the console
		lcd_send_string("convertinfinger");                                                                  // Send an error message to the LCD
		HAL_Delay(1000);                                                                                     // Delay for 1 second
		lcd_clear();                                                                                         // Clear the LCD display
		return f_status;                                                                                     // Return the status code
	}
	HAL_Delay(1000);                                                                                         // Delay for 1 second

	int pointer[3];                                                                                          // Create an array to store 2 integers
	char idString[4];                                                                                    // Create a character array to hold the string representation of the ID

	f_status = AS608_FingerFastSearch(pointer);                                                          // Search for a matching fingerprint

	id = pointer[0];                                                                                     // Assign the ID to the variable 'id'
	sprintf(idString, "%d", id);                                                                         // Convert the integer to a string

	if (f_status == FINGERPRINT_OK) {
		HAL_Delay(100);                                                                                  // Delay for 0.1 second
		printf("Fingerprint found with id = %d %s\n", pointer[0],enrollment_names[pointer[0]]);          // Print the ID of the found fingerprint to the console

		uint16_t employee_ID=pointer[0];

//		lcd_clear();                                                                                     // Clear the LCD display
//		HAL_Delay(2500);                                                                                 // Delay for 1.5 seconds
//		lcd_send_string("Finger Found\n");                                                               // Send a message to the LCD
		lcd_clear();
		HAL_Delay(1500);
		lcd_send_string("FOUND:");
		lcd_send_string(idString);                                                                       // Send the ID string to the LCD
		lcd_send_string(enrollment_names[id]);
		playTone(500,1000,20);
		stopTone();
		HAL_Delay(1500);                                                                                 // Delay for 1.5 seconds
		lcd_clear();                                                                                     // Clear the LCD display
		return employee_ID;                                                                              // Return the status code
	} else {
		printf("Fingerprint not found\n");                                                              // Print a message indicating the fingerprint was not found

		lcd_send_string("finger not found");                                                            // Send a message to the LCD
		lcd_send_string(idString);                                                                      // Send the ID string to the LCD
		playTone(500,1000,20);
		stopTone();
		HAL_Delay(2000);                                                                                // Delay for 2 seconds to display the message
		lcd_clear();                                                                                    // Clear the LCD display
	}

	return f_status;                                                                                    // Return the status code
}

void DeleteFinger(void)
{
//	HAL_Delay(500);                                                                                     // Delay for 1 second
	char ids[3];                                                                                        // Create an array to store 2 characters
	uint8_t i = 0;                                                                                      // Initialize a counter variable
	// Loop to get 2 key presses
	while (i < 2)
	{
		HAL_Delay(1000);                                                                                // Delay for 1 seconds
		printf("Enter the key\n");                                                                     // Prompt the user to press keys
		HAL_Delay(1000);
		lcd_send_string("Enter  your keys");
		HAL_Delay(1000);                                                                                // Delay for 1 seconds
		lcd_clear();
		ids[i] = keyPressed;                                                                            // Store the key press in 'ids' array
		i++;                                                                                            // Increment the counter
		HAL_Delay(1000);                                                                                // Delay for 1 seconds
	}

	ids[2] = '\0';                                                                                      // Add a null-terminator to the end of the 'ids' string

	id = atoi(ids);                                                                                     // Convert the two-character string 'ids' to an integer 'id'
	HAL_Delay(1500);
	lcd_clear();
	// Call a function to delete the fingerprint model associated with 'id'
	if(id>0&&id<100){
		AS608_DeleteModel(id);
		printf("Finger is deleted with id = %d %s\n", id,enrollment_names[id]); 						// Print a message indicating successful deletion
		HAL_Delay(1500);
		lcd_clear();
		lcd_send_string("DELID="); 																	// Send a message "DElFINGER=" to the LCD
		lcd_send_string(ids); 																			// Send the string 'ids' to the LCD
		lcd_send_string(enrollment_names[id]);
		playTone(500,1000,20);
		stopTone();
		HAL_Delay(1500);																				// Delay for 1.5 seconds (1500 milliseconds)
		lcd_clear(); 																					// Clear the LCD display
		keypressed = 0;																					// Reset a variable 'keypressed' to 0
	}else
	{
		printf("\nInvalid id. Please enter an id between 1 and 100.");
		lcd_send_string("Invalid id");
		HAL_Delay(1000); 																				// Delay for 1 seconds
		lcd_clear();
	}
}

void InputFinger(void)
{
	HAL_Delay(1000); 																// Delay for 1 second
	printf("press the first key\n");												// Prompt the user to press the first key
	lcd_send_string("pressthefirstkey\n");
	HAL_Delay(2000); 																// Delay for 2 seconds
	lcd_clear();
	ids[0] = keyPressed; 															// Store the key press in the first position of 'ids'
	printf("press the second key\n"); 												// Prompt the user to press the second key
	lcd_send_string("press2ndkey");
	HAL_Delay(2000); 																// Delay for 2 seconds
	lcd_clear();
	ids[1] = keyPressed; 															// Store the key press in the second position of 'ids'
	HAL_Delay(1000); 																// Delay for 1 second
	id = atoi(ids); 																// Convert the two-character string 'ids' to an integer 'id'
	if (id >0 && id <= 99) {
		EnrollFinger(id); 															// Call a function (EnrollFinger) with the 'id' as a parameter
	} else {
		printf("\nInvalid id. Please enter an id between 1 and 100.");
		lcd_send_string("Invalid id");
		HAL_Delay(1000); 															// Delay for 1 seconds
		lcd_clear();
	}
	keypressed = 0; 																// Reset a variable 'keypressed' to 0
}

uint8_t MatchFinger(void)
{
	HAL_Delay(1000);																 // Delay for 1 second
	uint8_t f_status = AS608_GetImage(); 											 // Attempt to capture a fingerprint image
	if (f_status != FINGERPRINT_OK) {
		printf("error in the getimage");					     					  // Print an error message to the console
		lcd_send_string("errorinfinger"); 											  // Send an error message to the LCD
		HAL_Delay(1000);															  // Delay for 1 second
		lcd_clear(); 																  // Clear the LCD display
		return f_status; 															  // Return the status code
	}
	HAL_Delay(1000); 																  // Delay for 1 second
	f_status = AS608_Image2Tz(1);                                                     // Convert the captured image to a template
	if (f_status != FINGERPRINT_OK) {
		printf("convert fail");  			    	        	 			 	      // Print an error message to the console
		lcd_send_string("convertinfinger");  			   	       	      	      	  // Send an error message to the LCD
		HAL_Delay(1000);		 			   	      	      	     	   		 	  // Delay for 1 second
		lcd_clear(); 	 				     	          	       	      	  	   	  // Clear the LCD display
		return f_status;	 										 	 	 		  // Return the status code
	}
	HAL_Delay(1000);  			   	      	      	                        	 	  // Delay for 1 second

	int pointer[3]; 		 			     	      	       	                      // Create an array to store 2 integers
	char idString[4];  	      	  	 	 	 	 		 	 	  		 	 	 	  // Create a character array to hold the string representation of the ID

	f_status = AS608_FingerFastSearch(pointer);                                       // Search for a matching fingerprint

	id = pointer[0]; 																  // Assign the ID to the variable 'id'
	sprintf(idString, "%d", id);	 			              	         	          // Convert the integer to a string

	if (f_status == FINGERPRINT_OK) {
		HAL_Delay(1000); 						 			     	       		 	// Delay for 1 second
		printf("Fingerprint already exist= %d %s\n", pointer[0],enrollment_names[pointer[0]]); // Print the ID of the found fingerprint to the console

		uint16_t employee_ID=pointer[0];

		lcd_clear(); 																	// Clear the LCD display
		HAL_Delay(2500); 																// Delay for 1.5 seconds
		lcd_send_string("Finger Found\n"); 												// Send a message to the LCD
		lcd_clear();
		HAL_Delay(1500);
		lcd_send_string("exist=");
		lcd_send_string(idString);														 // Send the ID string to the LCD
		lcd_send_string(enrollment_names[id]);
		playTone(500,1000,20);
		stopTone();
		HAL_Delay(1500); 																  // Delay for 1.5 seconds
		lcd_clear(); 																	  // Clear the LCD display
		return employee_ID;                                                               // Return the status code
	} else {
		InputFinger();
	}

	return f_status; 																	  // Return the status code
}

void EnrollFinger(uint8_t id) {

