InduPriya1525/ATTTENDANCE-MANAGEMENT-SYSTEM-USING-STM32F401/Core/Src/main.c
	printf("Place finger on the sensor\n");													// Step 1: Prompt the user to place their finger on the sensor
	lcd_send_string("Place finger");
	HAL_Delay(1000);																		// Delay for 1 seconds
	lcd_clear();
	while (AS608_GetImage() != FINGERPRINT_OK) { HAL_Delay(1000);break;}		   	  		// Step 2: Capture an image of the fingerprint
	// Step 3: Convert the captured image to a template
	while (AS608_Image2Tz(1) != FINGERPRINT_OK) {HAL_Delay(1000);break; }
	// Step 4: Prompt the user to remove and re-place the same finger
	printf("Remove finger and place the same finger again\n");
//	lcd_send_string("Remove and place");
	HAL_Delay(1000);																		 // Delay for 1 seconds
	lcd_clear();
	removeFingerPlaceFinger = true;
	// Step 5: Capture another image of the fingerprint
	while (AS608_GetImage() != FINGERPRINT_OK) { HAL_Delay(1000);break;}

	// Step 6: Convert the second captured image to a template
	while (AS608_Image2Tz(2) != FINGERPRINT_OK) {HAL_Delay(1000); break;}

	removeFingerPlaceFinger = false;

	// Step 7: Create a fingerprint model from the two templates
	if (AS608_CreateModel() == FINGERPRINT_OK) {
		// Step 8: Choose the appropriate buffer ID and page ID
		uint16_t pageID = id;
		char idString[10]; 																	// Create a character array to hold the string representation of the integer
		sprintf(idString, "%d", id); 														// Convert the integer to a string

		// Step 9: Store the fingerprint model in the specified buffer
		if (AS608_StoreModel( pageID) == FINGERPRINT_OK) {
			printf("Fingerprint enrolled for ID: %d ", id); 						 		 // Print a message indicating successful fingerprint enrollment along with the 'id'
			printf("%s\n",enrollment_names[id]);
			lcd_send_string("ID="); 														 // Send "ENROLL ID=" to the LCD
			lcd_send_string(idString);														 // Send the string representation of 'id' to the LCD
			lcd_send_string(enrollment_names[id]);
			playTone(800,1000,20);
			stopTone();
			HAL_Delay(1500);																 // Delay for 1.5 seconds
			lcd_clear();																	 // Clear the LCD display
		}
	}
	else {
		fingerprintStored = false;
		lcd_clear();
		lcd_send_string("fingernotenroled");
		playTone(800,100,20);
		stopTone();
	}
}


//Static functions
static void PacketInit(uint8_t type,uint16_t length,uint8_t* data)
{
	packet.start_code = FINGERPRINT_STARTCODE;
	packet.type = type;
	packet.length = length;
	for(uint8_t i = 0; i < 4; i++)
	{
		packet.address[i] = 0xFF;
	}
	if(length < 50)
	{
		memcpy(packet.data,data,length);

	}
	else
	{
		memcpy(packet.data,data,64);
	}
}

/**
	@brief Process a packet and send it over UART to the sensor
 */
static void WriteStructuredPacket(void)
{
	uint8_t leftshiftstartcode;
	uint8_t bitwiseand;
	uint8_t leftshiftwirelength;
	uint8_t bitwiseandwirelength;
	uint8_t leftshiftsum;
	uint8_t bitwiseandsum;
	leftshiftstartcode = packet.start_code >> 8;
	bitwiseand = packet.start_code & 0xFF;
	HAL_UART_Transmit(&huart1,(&leftshiftstartcode),1,HAL_MAX_DELAY);
	HAL_UART_Transmit(&huart1,(&bitwiseand),1,HAL_MAX_DELAY);
	HAL_UART_Transmit(&huart1,(&packet.address[0]),4,4);
	HAL_UART_Transmit(&huart1,(&packet.type),1,4);
	uint16_t wireLength = packet.length + 2;
	leftshiftwirelength = wireLength >> 8;
	bitwiseandwirelength = wireLength & 0xFF;
	HAL_UART_Transmit(&huart1,(&leftshiftwirelength),1,HAL_MAX_DELAY);
	HAL_UART_Transmit(&huart1,(&bitwiseandwirelength),1,HAL_MAX_DELAY);
	uint16_t sum = wireLength + packet.type;
	for (uint8_t i = 0; i < packet.length; i++)
	{
		HAL_UART_Transmit(&huart1,(&packet.data[i]),1,HAL_MAX_DELAY);
		sum += packet.data[i];
	}
	leftshiftsum = sum >> 8;
	bitwiseandsum = sum & 0xFF;
	HAL_UART_Transmit(&huart1,(&leftshiftsum),1,HAL_MAX_DELAY);
	HAL_UART_Transmit(&huart1,(&bitwiseandsum),1,HAL_MAX_DELAY);
}

/**
	@brief Receives data over UART from the sensor via DMA then processes
	the data into a packet/
	@return <code>FINGERPRINT_OK</code> on success
	@return <code>FINGERPRINT_TIMEOUT</code> or
					<code>FINGERPRINT_BADPACKET</code> on failure
 */
static uint8_t GetStructuredPacket(void)
{
	uint8_t nReceivedBytes = 0; 															// Initialize a variable to keep track of the number of received bytes

	while(1) 																				// Infinite loop
	{
		if(RxCplt == SET) 																	// If a reception is complete
		{
			RxCplt = RESET; 																// Reset the reception flag
			nReceivedBytes = RxbuffCntr; 													// Store the number of received bytes
			RxbuffCntr = 0; 																// Reset the reception buffer counter
			break; 																			// Exit the loop
		}
	}
	// Check if the received packet's start code matches the expected value
	if(rxPacketBuffer[0] == (FINGERPRINT_STARTCODE >> 8))
	{
		packet.start_code = (uint16_t)rxPacketBuffer[0] << 8;                               // Extract and set the start code
	}

	packet.start_code |= rxPacketBuffer[1];                                                 // Combine the start code with the second byte

	if(packet.start_code != FINGERPRINT_STARTCODE)                                          // Check if start code is valid
	{
		memset(rxPacketBuffer, 0, nReceivedBytes);                                          // Clear the rx packet buffer
		return FINGERPRINT_BADPACKET;                                                       // Return a status indicating a bad packet
	}
	// Extract address bytes
	for(uint8_t i = 2; i <= 5; i++)
	{
		packet.address[i - 2] = rxPacketBuffer[i];
	}

	packet.type = rxPacketBuffer[6]; 	 						 	 	 	 	 	 	 	// Extract packet type
	packet.length = (uint16_t)rxPacketBuffer[7] << 8;									    // Extract packet length (high byte)
	packet.length |= rxPacketBuffer[8]; 													// Extract packet length (low byte)

	// Extract data bytes
	for(uint8_t i = 9; i < nReceivedBytes; i++)
	{
		packet.data[i - 9] = rxPacketBuffer[i];

		// Check if all data bytes have been received
		if((i - 8) == packet.length)
		{
			memset(rxPacketBuffer, 0, nReceivedBytes); 										// Clear the rx packet buffer
			return FINGERPRINT_OK; 															// Return a status indicating a successful packet reception
		}
	}

	return FINGERPRINT_BADPACKET; 															// Return a status indicating an incomplete packet
}


//Variadic macros
/**
 * @brief Gets the command packet
 */
#define GET_CMD_PACKET(...)                                                    \
		do {                                                                          \
			uint8_t packet_data[] = {__VA_ARGS__};                                      \
			PacketInit(FINGERPRINT_COMMANDPACKET, sizeof(packet_data), packet_data);    \
			WriteStructuredPacket();                                                    \
			if (GetStructuredPacket() != FINGERPRINT_OK)                                \
			return FINGERPRINT_PACKETRECIEVEERR;                                      \
			if (packet.type != FINGERPRINT_ACKPACKET)                                   \
			return FINGERPRINT_PACKETRECIEVEERR;                                      \
		} while (0)


/**
 * @brief Sends the command packet
 */
#define SEND_CMD_PACKET(...)                                                   \
		GET_CMD_PACKET(__VA_ARGS__);                                                 \
		return packet.data[0];

/**
	@brief Ask the sensor to take an image of the finger pressed on surface
	@return <code>FINGERPRINT_OK</code> on success
	@return <code>FINGERPRINT_NOFINGER</code> if no finger detected
	@return <code>FINGERPRINT_PACKETRECIEVEERR</code> on communication error
	@return <code>FINGERPRINT_IMAGEFAIL</code> on imaging error
 */
uint8_t AS608_GetImage(void)
{
	SEND_CMD_PACKET(FINGERPRINT_GETIMAGE);
}

/**
	@brief Ask the sensor to convert image to feature template
	@param slot Location to place feature template (put one in 1 and another in
	2 for verification to create model)
	@return <code>FINGERPRINT_OK</code> on success
	@return <code>FINGERPRINT_IMAGEMESS</code> if image is too messy
	@return <code>FINGERPRINT_PACKETRECIEVEERR</code> on communication error
	@return <code>FINGERPRINT_FEATUREFAIL</code> on failure to identify
	fingerprint features
	@return <code>FINGERPRINT_INVALIDIMAGE</code> on failure to identify
	fingerprint features
 */
uint8_t AS608_Image2Tz(uint8_t slot)
{
	SEND_CMD_PACKET(FINGERPRINT_IMAGE2TZ,slot );
}

/**
	@brief Ask the sensor to take two print feature template and create a
	model
	@return <code>FINGERPRINT_OK</code> on success
	@return <code>FINGERPRINT_PACKETRECIEVEERR</code> on communication error
	@return <code>FINGERPRINT_ENROLLMISMATCH</code> on mismatch of fingerprints
 */
uint8_t AS608_CreateModel(void)
{
	SEND_CMD_PACKET(FINGERPRINT_REGMODEL);
}

/**
	@brief Ask the sensor to delete ALL models in memory
	@return <code>FINGERPRINT_OK</code> on success
	@return <code>FINGERPRINT_BADLOCATION</code> if the location is invalid
	@return <code>FINGERPRINT_FLASHERR</code> if the model couldn't be written
	to flash memory
	@return <code>FINGERPRINT_PACKETRECIEVEERR</code> on communication error
 */
uint8_t AS608_EmptyDatabase(void)
{
	SEND_CMD_PACKET(FINGERPRINT_EMPTY);
}


uint8_t AS608_TEMPLATECOUNT(void)
{
	GET_CMD_PACKET(FINGERPRINT_TEMPLATECOUNT,0x01,7,0x00);
	return packet.data[0];
}
/**
	@brief Ask the sensor to store the calculated model for later matching
	@param location The model location #
	@return <code>FINGERPRINT_OK</code> on success
	@return <code>FINGERPRINT_BADLOCATION</code> if the location is invalid
	@return <code>FINGERPRINT_FLASHERR</code> if the model couldn't be written
	to flash memory
	@return <code>FINGERPRINT_PACKETRECIEVEERR</code> on communication error
 */

