InduPriya1525/ATTTENDANCE-MANAGEMENT-SYSTEM-USING-STM32F401/Core/Src/main.c
uint8_t AS608_StoreModel(uint16_t id)
{
	SEND_CMD_PACKET(FINGERPRINT_STORE, 0x01, (uint8_t)(id >> 8), (uint8_t)(id & 0xFF));
}

/**
	@brief Ask the sensor to load a fingerprint model from flash into buffer 1
	@param location The model location
	@return <code>FINGERPRINT_OK</code> on success
	@return <code>FINGERPRINT_BADLOCATION</code> if the location is invalid
	@return <code>FINGERPRINT_PACKETRECIEVEERR</code> on communication error
 */
uint8_t AS608_LoadModel(uint16_t id)
{
	SEND_CMD_PACKET(FINGERPRINT_LOAD, 0x01, (uint8_t)(id >> 8), (uint8_t)(id & 0xFF));
}

/**
	@brief Ask the sensor to transfer 256-byte fingerprint template from the
	buffer to the UART
	@return <code>FINGERPRINT_OK</code> on success
	@return <code>FINGERPRINT_PACKETRECIEVEERR</code> on communication error
 */
uint8_t AS608_GetModel(void)
{
	SEND_CMD_PACKET(FINGERPRINT_UPLOAD, 0x01);
}


/**
	@brief Ask the sensor to delete a model in memory
	@param location The model location #
	@return <code>FINGERPRINT_OK</code> on success
	@return <code>FINGERPRINT_BADLOCATION</code> if the location is invalid
	@return <code>FINGERPRINT_FLASHERR</code> if the model couldn't be written
	to flash memory
	@return <code>FINGERPRINT_PACKETRECIEVEERR</code> on communication error
 */
uint8_t AS608_DeleteModel(uint16_t id)
{
	SEND_CMD_PACKET(FINGERPRINT_DELETE, (uint8_t)(id >> 8), (uint8_t)(id & 0xFF), 0x00, 0x01);

}

/**
	@brief Ask the sensor to search the current slot 1 fingerprint features to
	match saved templates. The matching location is stored in <b>fingerID</b> and
	the matching confidence in <b>confidence</b>
	@return <code>FINGERPRINT_OK</code> on fingerprint match success
	@return <code>FINGERPRINT_NOTFOUND</code> no match made
	@return <code>FINGERPRINT_PACKETRECIEVEERR</code> on communication error
 */
uint8_t AS608_FingerFastSearch(int *ptr)
{
	GET_CMD_PACKET(FINGERPRINT_HISPEEDSEARCH, 0x01, 0x00, 0x00, 0x00, 0xA3);
	*ptr=packet.data[2];                                                                  //it store the template id into the arraypointer
	return packet.data[0];
}

void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
	txCplt = SET;
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
	if(huart->Instance == USART1)
	{
		printf("%c",Rxbuff);

		HAL_UART_Receive_IT(&huart1, (uint8_t *)&Rxbuff, sizeof(Rxbuff));              //, HAL_MAX_DELAY);//(&huart1,(uint8_t *)&Rxbuff,1);
		rxPacketBuffer[RxbuffCntr++] = Rxbuff;
		if(RxbuffCntr >= 12)
		{
			RxCplt = SET;
		}
	}
	else if(huart->Instance==USART2)
	{
		HAL_UART_Receive_IT(&huart2, (uint8_t *)&Rxbuff, sizeof(Rxbuff));

		// Check for specific condition to call enroll() for UART2
		if (Rxbuff == 'A')
		{
			keypressed = 'A';
			//InputFinger();
		}
		else if (Rxbuff == 'B'){
			keypressed = 'B';
			//FindFingerprint();
		}
		else if (Rxbuff == 'C'){
			keypressed = 'C';
			//DeleteFinger();
		}
		else if (Rxbuff == 'D'){
			keypressed = 'D';
			//AS608_EmptyDatabase();
		}
	}
}

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
	currentMillis = HAL_GetTick();
	if (currentMillis - previousMillis > 1000) {
		/*Configure GPIO pins : PB6 PB7 PB8 PB9 to GPIO_INPUT*/
		GPIO_InitStructPrivate.Pin = GPIO_PIN_6|GPIO_PIN_7|GPIO_PIN_8|GPIO_PIN_9;
		GPIO_InitStructPrivate.Mode = GPIO_MODE_INPUT;
		GPIO_InitStructPrivate.Pull = GPIO_NOPULL;
		GPIO_InitStructPrivate.Speed = GPIO_SPEED_FREQ_LOW;
		HAL_GPIO_Init(GPIOB, &GPIO_InitStructPrivate);

		HAL_GPIO_WritePin(GPIOA, GPIO_PIN_15, 1);
		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_3, 0);
		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_4, 0);
		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_5, 0);
		if(GPIO_Pin == GPIO_PIN_6 && HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6))
		{
			keyPressed = 49; //ASCII value of D
		}
		else if(GPIO_Pin == GPIO_PIN_7 && HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_7))
		{
			keyPressed = 50; //ASCII value of C
		}
		else if(GPIO_Pin == GPIO_PIN_8 && HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_8))
		{
			keyPressed = 51; //ASCII value of B
		}
		else if(GPIO_Pin == GPIO_PIN_9 && HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_9))
		{
			keyPressed = 65; //ASCII value of A
		}

		HAL_GPIO_WritePin(GPIOA, GPIO_PIN_15, 0);
		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_3, 1);
		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_4, 0);
		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_5, 0);
		if(GPIO_Pin == GPIO_PIN_6 && HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6))
		{
			keyPressed = 52; //ASCII value of #
		}
		else if(GPIO_Pin == GPIO_PIN_7 && HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_7))
		{
			keyPressed = 53; //ASCII value of 9
		}
		else if(GPIO_Pin == GPIO_PIN_8 && HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_8))
		{
			keyPressed = 54; //ASCII value of 6
		}
		else if(GPIO_Pin == GPIO_PIN_9 && HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_9))
		{
			keyPressed = 66; //ASCII value of 3
		}

		HAL_GPIO_WritePin(GPIOA, GPIO_PIN_15, 0);
		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_3, 0);
		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_4, 1);
		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_5, 0);
		if(GPIO_Pin == GPIO_PIN_6 && HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6))
		{
			keyPressed = 55; //ASCII value of 0
		}
		else if(GPIO_Pin == GPIO_PIN_7 && HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_7))
		{
			keyPressed = 56; //ASCII value of 8
		}
		else if(GPIO_Pin == GPIO_PIN_8 && HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_8))
		{
			keyPressed = 57; //ASCII value of 5
		}
		else if(GPIO_Pin == GPIO_PIN_9 && HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_9))
		{
			keyPressed = 67; //ASCII value of 2
		}

		HAL_GPIO_WritePin(GPIOA, GPIO_PIN_15, 0);
		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_3, 0);
		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_4, 0);
		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_5, 1);
		if(GPIO_Pin == GPIO_PIN_6 && HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6))
		{
			keyPressed = 42; //ASCII value of *
		}
		else if(GPIO_Pin == GPIO_PIN_7 && HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_7))
		{
			keyPressed = 48; //ASCII value of 7
		}
		else if(GPIO_Pin == GPIO_PIN_8 && HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_8))
		{
			keyPressed = 35; //ASCII value of 4
		}
		else if(GPIO_Pin == GPIO_PIN_9 && HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_9))
		{
			keyPressed = 68; //ASCII value of 1
		}

		HAL_GPIO_WritePin(GPIOA, GPIO_PIN_15, 1);
		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_3, 1);
		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_4, 1);
		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_5, 1);
		/*Configure GPIO pins : PB6 PB7 PB8 PB9 back to EXTI*/
		GPIO_InitStructPrivate.Mode = GPIO_MODE_IT_RISING;
		GPIO_InitStructPrivate.Pull = GPIO_PULLDOWN;
		HAL_GPIO_Init(GPIOB, &GPIO_InitStructPrivate);
		previousMillis = currentMillis;
	}
}

void send_to_lcd (char data, int rs)
{
	HAL_GPIO_WritePin(RS_GPIO_Port, RS_Pin, rs);  // rs = 1 for data, rs=0 for command



	/* write the data to the respective pin */
	HAL_GPIO_WritePin(D7_GPIO_Port, D7_Pin, ((data>>3)&0x01));
	HAL_GPIO_WritePin(D6_GPIO_Port, D6_Pin, ((data>>2)&0x01));
	HAL_GPIO_WritePin(D5_GPIO_Port, D5_Pin, ((data>>1)&0x01));
	HAL_GPIO_WritePin(D4_GPIO_Port, D4_Pin, ((data>>0)&0x01));

