InduPriya1525/ATTTENDANCE-MANAGEMENT-SYSTEM-USING-STM32F401/Core/Src/main.c
	/* Toggle EN PIN to send the data
	 * if the HCLK > 100 MHz, use the  20 us delay
	 * if the LCD still doesn't work, increase the delay to 50, 80 or 100..
	 */
	delay (100);
	HAL_GPIO_WritePin(EN_GPIO_Port, EN_Pin, 1);
	delay (100);
	HAL_GPIO_WritePin(EN_GPIO_Port, EN_Pin, 0);
}

void lcd_send_cmd (char cmd)
{
	char datatosend;
	/*send upper nibble first */
	datatosend = ((cmd>>4)&0x0f);
	send_to_lcd(datatosend,0);  // RS must be 0 while sending command

	/* send Lower Nibble */
	datatosend = ((cmd)&0x0f);
	send_to_lcd(datatosend, 0);
}

void lcd_send_data (char data)
{
	char datatosend;
	/* send higher nibble */
	datatosend = ((data>>4)&0x0f);
	send_to_lcd(datatosend, 1);  // rs =1 for sending data
	/* send Lower nibble */
	datatosend = ((data)&0x0f);
	send_to_lcd(datatosend, 1);
}

void lcd_clear (void)
{
	lcd_send_cmd(0x01);
	HAL_Delay(2);
}

void lcd_put_cur(int row, int col)
{
	switch (row)
	{
	case 0:
		col |= 0x80;
		break;
	case 1:
		col |= 0xC0;
		break;
	}
	lcd_send_cmd (col);
}

void lcd_init (void)
{
	// 4 bit initialisation
	HAL_Delay(50); 																				// wait for >40ms
	lcd_send_cmd (0x30); 																		//command for 4 bit initialization.
	HAL_Delay(5);  																				// wait for >4.1ms
	lcd_send_cmd (0x30); 																		//command for 4 bit initialization.
	HAL_Delay(1);  																				// wait for >100us
	lcd_send_cmd (0x30);																	    //command for 4 bit initialization.
	HAL_Delay(10);
	lcd_send_cmd (0x20);  // 4bit mode
	HAL_Delay(10);

	// dislay initialisation
	// Function set --> DL=0 (4 bit mode), N = 1 (2 line display) F = 0 (5x8 characters)
	lcd_send_cmd (0x28);
	HAL_Delay(1);
	lcd_send_cmd (0x08);                                                                      //Display on/off control --> D=0,C=0, B=0  ---> display off
	HAL_Delay(1);
	lcd_send_cmd (0x01);                                                                      // clear display
	HAL_Delay(1);
	HAL_Delay(1);
	lcd_send_cmd (0x06);                                                                    //Entry mode set --> I/D = 1 (increment cursor) & S = 0 (no shift)
	HAL_Delay(1);
	//Display on/off control --> D = 1, C and B = 0. (Cursor and blink, last two bits)
	lcd_send_cmd (0x0C);
}

void lcd_send_string (char *str)
{
	while (*str) lcd_send_data (*str++);
}

void playTone(uint16_t frequency,uint16_t ms,uint8_t dc)
{
	// HAL_GPIO_TogglePin(GPIOC,GPIO_PIN_13);
	//HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, SET);
	//int duration = 1000/frequency;//calculate the duration of tone
	__HAL_TIM_SET_PRESCALER(&htim2,84000000/(frequency*frequency));//set the prescaler to generate the desired frequency.
	__HAL_TIM_SET_AUTORELOAD(&htim2,ms);//set the auto-reload value to generate the desired duration

	HAL_TIM_PWM_Start(&htim2,TIM_CHANNEL_1);
	htim2.Instance->CCR1 = dc;//vary the duty cycle
	HAL_Delay(ms);
	/**** FOR STOPPING THE BUZZER********/
	//HAL_GPIO_TogglePin(GPIOC,GPIO_PIN_13);
	// HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, RESET);
	//  HAL_TIM_PWM_Stop(&htim2,TIM_CHANNEL_1);

}

void stopTone(void)
{
	HAL_TIM_PWM_Stop(&htim2,TIM_CHANNEL_1);
}


void eraseFlashSector(uint32_t sector)
{
	// Define variables
	FLASH_EraseInitTypeDef eraseInitStruct;
	uint32_t sectorError = 0;
	HAL_StatusTypeDef status;
	HAL_FLASH_Unlock();                                                                            	// Unlock the Flash memory

	// Fill erase structure
	eraseInitStruct.TypeErase = FLASH_TYPEERASE_SECTORS;                                          // Specify sector erase operation
	eraseInitStruct.VoltageRange = FLASH_VOLTAGE_RANGE_3;                                        // Set voltage range for the erase operation
	eraseInitStruct.Sector = sector;                                                            // Specify the sector to be erased
	eraseInitStruct.NbSectors = 1;                                                             // Number of sectors to erase
	status = HAL_FLASHEx_Erase(&eraseInitStruct, &sectorError);                               // Erase the desired sector
	HAL_FLASH_Lock();                                                                      	// Lock the Flash memory

	if (status != HAL_OK)
	{
		// Handle erase error
		// ...
	}
}



/* USER CODE END 4 */

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler(void)
{
	/* USER CODE BEGIN Error_Handler_Debug */
	/* User can add his own implementation to report the HAL error return state */
	__disable_irq();
	while (1)
	{
	}
	/* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
 * @brief  Reports the name of the source file and the source line number
 *         where the assert_param error has occurred.
 * @param  file: pointer to the source file name
 * @param  line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t *file, uint32_t line)
{
	/* USER CODE BEGIN 6 */
	/* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
	/* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
